{
    "name": "Barbarian",
    "hitpoints": 12,
    
    "keyAbility": "STR",
    
    "proficiencyBonuses": {
      "saving_throws:fortitude": "EXPERT",
      "saving_throws:reflex": "TRAINED",
      "saving_throws:will": "EXPERT",
      "saving_throws:perception": "EXPERT",
      
      "skills:athletics": "TRAINED",
      
      "attacks:simple_weapons": "TRAINED",
      "attacks:martial_weapons": "TRAINED",
      "attacks:unarmed_attacks": "TRAINED",
      
      "armor:light_armor": "TRAINED",
      "armor:medium_armor": "TRAINED",
      "armor:unarmored_defense": "TRAINED",
      
      "class_dc": "TRAINED"
    },
    "subclass": true,
    "subclasses": [
      {
        "name": "Animal Instinct",
        "description": "The fury of a wild predator fills you when you Rage, granting you ferocious unarmed attacks. Cultures that revere vicious animals (such as apes or bears) give rise to barbarians with this instinct. You might also be at war with an uncontrollable, animalistic side of your personality, or you might be a descendant of a werewolf or another werecreature. Select an Animal Instincts that best matches your chosen animal.",
        "features": [
          {
            "name": "Animal Instincts",
            "level": 1,
            "choices": [
              {
                "name": "Ape",
                "actions": {
                    "name": "Ape Fist",
                    "description": "You attack with your fist dealing 1d10 B damage.",
                    "traits": [
                        "Grapple",
                        "Unarmed"
                    ]
                }
              }
            ]          
          }, 
          {
            "type": "feat",
            "name": "Anathema",
            "level": 1,
            "description": "Flagrantly disrespecting an animal of your chosen kind is anathema to your instinct, as is using weapons while raging"
          },
          {
            "type": "feat",
            "name": "Bestial Rage",
            "level": 1,
            "description": "When you Rage, you gain your chosen animal’s unarmed attack (or attacks). The specific attack gained, the damage it deals, and its traits are listed. These attacks are in the brawling group. Your Rage action gains the morph, primal, and transmutation traits."
          },
          {
            "type": "feat",
            "name": "Specialization Ability",
            "level": 7,
            "description": "Increase the damage die size for the unarmed attacks granted by your chosen animal by one step, and increase the additional damage from Rage from 2 to 5 for your chosen animal’s unarmed attacks. The frog’s tongue attack and deer’s antler attack gain reach 10 feet. If you have greater weapon specialization, increase the damage from Rage from 5 to 12 for your chosen animal’s unarmed attacks."
          },
          {
            "type": "feat",
            "name": "Raging Resistance",
            "level": 9,
            "description": "You resist piercing and slashing damage"
          }
        ]
      }
    ],
    "level1Feat": true,
    "features": [
      {
        "name": "Rage",
        "description": "You gain the Rage action, which lets you fly into a frenzy.",
        "level": 1,
        "traits": [
            "Barbarian"
        ],
        "action": {
            "name": "Rage",
            "time": "1 action",
            "description": "You tap into your inner fury and begin raging. You gain a number of temporary Hit Points equal to your level plus your Constitution modifier. This frenzy lasts for 1 minute, until there are no enemies you can perceive, or until you fall unconscious, whichever comes first. You can’t voluntarily stop raging. While you are raging: You deal 2 additional damage on melee Strikes.  This additional damage is halved if your weapon or unarmed attack is agile.  • You take a –1 penalty to AC.  • You can’t use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.  After you stop raging, you lose any remaining temporary Hit Points from Rage, and you can’t Rage again for 1 minute.",
            "traits": [
              "Barbarian",
              "Concentrate",
              "Emotion",
              "Mental"
            ],
            "requirements": "You aren't fatigued or raging"
        }
      }
    ]
}
